In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data=[6,7,8,9,10]
dta=pd.DataFrame(data)
dta

    0
0   6
1   7
2   8
3   9
4  10

In [4]:
data=[['Alex1',101],['Bob2',152],['Marley3',203]]
dta=pd.DataFrame(data)
dta

         0    1
0    Alex1  101
1     Bob2  152
2  Marley3  203

In [5]:
a=pd.Series([0,2,4,np.nan,7,9])
a

0    0.0
1    2.0
2    4.0
3    NaN
4    7.0
5    9.0
dtype: float64

In [10]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.708712 -0.595699  0.311675  0.855433
2013-01-02 -0.932041 -1.214431  1.209717 -0.825295
2013-01-03 -1.087685 -1.139124 -1.417677  0.702550
2013-01-04  0.033301  1.730490 -0.418626 -0.874787
2013-01-05 -0.517226 -0.236695 -0.837706  0.761145
2013-01-06  1.067602  0.112658 -0.278206  1.302555

In [12]:
df2 = pd.DataFrame({'A': 1.,'B': pd.Timestamp('20130102'),'C': pd.Series(1, index=list(range(4)), dtype='float32'),'D': np.array([3] * 4, dtype='int32'),'E': pd.Categorical(["test", "train", "test", "train"]),'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df.head()

                   A         B         C         D
2013-01-01  0.708712 -0.595699  0.311675  0.855433
2013-01-02 -0.932041 -1.214431  1.209717 -0.825295
2013-01-03 -1.087685 -1.139124 -1.417677  0.702550
2013-01-04  0.033301  1.730490 -0.418626 -0.874787
2013-01-05 -0.517226 -0.236695 -0.837706  0.761145

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.033301  1.730490 -0.418626 -0.874787
2013-01-05 -0.517226 -0.236695 -0.837706  0.761145
2013-01-06  1.067602  0.112658 -0.278206  1.302555

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[ 0.70871191, -0.59569943,  0.31167459,  0.85543266],
       [-0.93204124, -1.21443101,  1.20971746, -0.82529516],
       [-1.08768515, -1.13912431, -1.41767718,  0.70255025],
       [ 0.03330105,  1.73048991, -0.41862599, -0.87478736],
       [-0.5172259 , -0.23669544, -0.83770567,  0.7611453 ],
       [ 1.0676019 ,  0.11265818, -0.27820569,  1.30255537]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.121223 -0.223800 -0.238470  0.320267
std    0.880258  1.085366  0.914719  0.930836
min   -1.087685 -1.214431 -1.417677 -0.874787
25%   -0.828337 -1.003268 -0.732936 -0.443334
50%   -0.241962 -0.416197 -0.348416  0.731848
75%    0.539859  0.025320  0.164205  0.831861
max    1.067602  1.730490  1.209717  1.302555

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.708712   -0.932041   -1.087685    0.033301   -0.517226    1.067602
B   -0.595699   -1.214431   -1.139124    1.730490   -0.236695    0.112658
C    0.311675    1.209717   -1.417677   -0.418626   -0.837706   -0.278206
D    0.855433   -0.825295    0.702550   -0.874787    0.761145    1.302555